BE/MTBTrip/app/controllers/trails_controller.rb

SELECT "trails".* FROM "trails"
---
    def index
        @trails = Trail.all

INSERT INTO "trails" ("name", "difficulty", "rating", "url", "img", "length", "eChange", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @trail = Trail.create(allowed_params)