BE/MTBTrip/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."firstname" = ? AND "users"."lastname" = ? LIMIT ?  [["firstname", ""], ["lastname", ""], ["LIMIT", 1]]
INSERT INTO "users" ("firstname", "lastname", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstname", "Devin"], ["lastname", "Arnold"], ["note", ""], ["created_at", "2019-08-01 21:37:30.750273"], ["updated_at", "2019-08-01 21:37:30.750273"]]
---
    def create
        @user = User.find_by(firstname:params[:firstname], lastname:params[:lastname])
        if !@user
          @user = User.create(allowed_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "note" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["note", "gfndgfhdgf"], ["updated_at", "2019-08-01 21:57:44.950257"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        @user.note = params[:note]
        @user.save